theely/B005CSerial/Middlewares/ST/STM32_UART_EMUL_Library/Src/stm32f4xx_hal_uart_emul.c
    }
    break;
    case UART_EMUL_PARITY_EVEN:
    {
      /* Initialize Parity Bit */
      if ((cntparity % 2) != SET)
      {
        pBuffer_Tx[length] = (bitmask << 16);
      }
      else
      {
        pBuffer_Tx[length] = bitmask;
      }
    }
    break;
    default:
      break;
  }
  /* Initialize Bit Start */
  pBuffer_Tx[0] = (bitmask << 16);

  if (huart->Init.StopBits == UART_EMUL_STOPBITS_1)
  {
    /* Initialize Bit Stop  */
    pBuffer_Tx[length+1] = bitmask;
  }
  else
  {
    /* Initialize Bit Stop  */
    pBuffer_Tx[length+1] = bitmask;
    pBuffer_Tx[length+2] = bitmask;
  }
  /* Reset counter parity */
  cntparity = 0;
}

/**
  * @brief  Sends an amount of Frames
  * @param  huart: UART Emulation handle
  * @param  pData: Frame to be sent
  * @retval None
  */
static void UART_Emul_TransmitFrame(UART_Emul_HandleTypeDef *huart)
{
  uint32_t tmp_sr = 0;
  uint32_t tmp_ds = 0;
  uint32_t tmp_size = 0;

	
  if ((huart_emul->TxXferCount % 2 ) != 0)
  {
    tmp_sr = (uint32_t)pFirstBuffer_Tx;
  }
  else
  {
    tmp_sr = (uint32_t)pSecondBuffer_Tx;
  }

	tmp_ds = (uint32_t) & ((huart->TxPortName)->BSRR);
	
  tmp_size = __HAL_UART_EMUL_FRAME_LENGTH(huart);

  /* Configure DMA Stream data length */
  hdma_tx.Instance->NDTR = tmp_size;

  /* Configure DMA Stream destination address */
  hdma_tx.Instance->PAR = tmp_ds;

  /* Configure DMA Stream source address */
  hdma_tx.Instance->M0AR = tmp_sr;

  /* Enable the transfer complete interrupt */
  __HAL_DMA_ENABLE_IT(&hdma_tx, DMA_IT_TC);

  /* Enable the transfer Error interrupt */
  __HAL_DMA_ENABLE_IT(&hdma_tx, DMA_IT_TE);

  /* Enable the Peripheral */
  __HAL_DMA_ENABLE(&hdma_tx);

  /* Enable the TIM Update DMA request */
  __HAL_TIM_ENABLE_DMA(&TimHandle, TIM_DMA_CC1);

  /* Enable the Peripheral */
  __HAL_TIM_ENABLE(&TimHandle);

}

/**
  * @brief  This function is executed in case of Transfer Complete of a Frame.
  * @param  None
  * @retval None
  */
static void UART_Emul_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
  uint32_t tmpbuffer = 0;

  /* Incremente Counter of frame */
  huart_emul->TxXferCount++;

  if (huart_emul->TxXferCount <= huart_emul->TxXferSize)
  { 

    /* Call UART Emulation Transmit frame for next Frame */
    UART_Emul_TransmitFrame(huart_emul);

    if ((huart_emul->TxXferCount % 2 ) != 0)
    {
      tmpbuffer = (uint32_t)pSecondBuffer_Tx;
    }
    else
    {
      tmpbuffer = (uint32_t)pFirstBuffer_Tx;
    }
    /* Format second Data to be sent */
    UART_Emul_TransmitFormatFrame(huart_emul, *(huart_emul->pTxBuffPtr + huart_emul->TxXferCount), (uint32_t*)tmpbuffer);
  }
  else
  {
    /* Disable the transfer complete interrupt */
    __HAL_DMA_DISABLE_IT(TimHandle.hdma[TIM_DMA_ID_CC1], DMA_IT_TC);

    /* Set TC flag in the status register software */
    __HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_TC);

    /* De_Initialize counter frame for Tx */
    huart_emul->TxXferCount = 0;

    /* Initialize the UART Emulation state */
    huart_emul->ErrorCode = HAL_UART_EMUL_ERROR_NONE;

    /* Check if a receive process is ongoing or not */
    if (huart_emul->State == HAL_UART_EMUL_STATE_BUSY_TX_RX)
    {
      huart_emul->State = HAL_UART_EMUL_STATE_BUSY_RX;
    }
    else
    {
      huart_emul->State = HAL_UART_EMUL_STATE_READY;
    }
    /* Handle for UART Emulation Transfer Complete */
    HAL_UART_Emul_TxCpltCallback(huart_emul);
  }
}

/**
  * @brief  This function is executed in case of error of Transfer occurrence.
  * @param  hdma : DMA Handle
  * @retval None
  */
static void UART_Emul_DMAError(DMA_HandleTypeDef *hdma)
{
  /* UART Emulation frame error occurred */
  __HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_FE);

  huart_emul->ErrorCode |= HAL_UART_EMUL_ERROR_FE;

  HAL_UART_Emul_ErrorCallback(huart_emul);
}

/**
  * @brief  Initializes the UART Emulation Transfer Complete.
  * @param  huart: UART Emulation Handle
  * @retval None
  */
__weak void HAL_UART_Emul_TxCpltCallback(UART_Emul_HandleTypeDef *huart)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_UART_Emul_TransferComplete could be implemented in the user file
   */
}

/**
  * @brief  UART Emulation error callbacks.
  * @param  huart: UART Emulation handle
  * @retval None
  */
__weak void HAL_UART_Emul_ErrorCallback(UART_Emul_HandleTypeDef *huart)
{
  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_UART_ErrorCallback could be implemented in the user file
   */
}

/**
  * @}
  */

#endif /* HAL_UART_EMUL_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
